meghamurali2324/STM32_programs/drivernew/Driver_Dev/Src/gpioint.c
/*
 * gpioint.c
 *
 *  Created on: Feb 19, 2026
 *      Author: megha
 */


#include <stdint.h>
#include "stm32f446xx.h"
#include "stm32_GPIO_Driver.h"


void delay1(void)
{
	for(uint32_t i = 0 ; i < 5000000 ; i ++);
}

int main1(void){
	GPIO_Handle_t GpioLed, GpioIntr;

	/*
	 * config for LED
	 */
	GpioLed.pGPIOx = GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber= GPIO_PIN_NO_5;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOA, ENABLE);

	GPIO_Init(&GpioLed);


	GpioIntr.pGPIOx = GPIOC;
	GpioIntr.GPIO_PinConfig.GPIO_PinNumber= GPIO_PIN_NO_13;
	GpioIntr.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_FT;
	GpioIntr.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioIntr.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

	GPIO_PeriClockControl(GPIOC, ENABLE);

	GPIO_Init(&GpioIntr);

	GPIO_IRQInterruptConfig(IRQ_NO_EXTI15_10, ENABLE);
	while(1);


}
void EXTI15_10_IRQHandler(void)
{
	GPIO_IRQHandling(GPIO_PIN_NO_13); //clear the pending event from exti line
	GPIO_ToggleOutputPin(GPIOA,GPIO_PIN_NO_5);
	delay1();
}
